INSERT INTO address (city, street, latitude, longitude) VALUES
('м. Івано-Франківськ', 'вул. Євгена Коновальця, 229', 48.90727690575747, 24.716455981655702),
('м. Львів', 'вул. Пирогівка, 42', 49.80339113541739, 24.081925899736376),
('м. Київ', 'Велика Окружна дорога, 98а', 50.40909444512023, 30.398960144522583),
('м. Вінниця', 'вул. Київська, 16', 49.23914764534477, 28.480540659922774);

INSERT INTO warehouse (title, address_id) VALUES
('Івано-Франківський склад', 1),
('Львівський склад', 2),
('Київський склад', 3),
('Вінницький склад', 4);

INSERT INTO transporter (name, car_model, load_capacity) VALUES
('Мироненко В.Р.', 'DAF XF105', 15590),
('Огоновський Ч.Р.', 'Volvo FH16', 34000),
('Костогриз Д.О.', 'Volkswagen LK40', 1125),
('Палагнюк З.С.', 'DAF XF105', 15590),
('Конончук Й.О.', 'Renault Traffic', 1266),
('Гудзь А.Б.', 'Mercedes Sprinter', 3494),
('Вінтонів О.К.', 'Man TGX', 22050),
('Овечко П.У.', 'Iveco S-Way', 11705);

INSERT INTO delivery (cargo_name, cargo_amount, delivery_status, warehouse_from_id, warehouse_to_id, transporter_id) VALUES
('огірки', 18000, 'P_U', 1, 3, 7),
('морква', 1100, 'A', 1, 4, 3),
('херсонські кавуни', 32000, 'I_T', 2, 2, 2),
('грейпфрути', 800, 'I_T', 2, 4, 5),
('апельсини', 3100, 'A', 1, 3, 6),
('ківі', 1000, 'P_U', 3, 2, 3),
('помідори', 11000, 'C', 4, 3, 4),
('банани', 17000, 'D', 2, 1, 7),
('мандарини', 10000, 'I_T', 3, 2, 8),
('цибуля', 14000, 'A', 2, 3, 4),
('дині', 12000, 'D', 4, 1, 1),
('яблука', 13500, 'P_U', 3, 2, 1);